/* 
이임!
나는 코딩요정 이만빈!
너희 무지렁이들에게 자바스크립트의 기초중의 기초를 알려주려고 해!

1. Javascript에서 뭔가를 선언하고 싶다!

자바스크립트에선 뭔가를 선언하고 싶을 때 var, let, const를 써.
근데 개초보 무지렁이인 너희들은 딱 하나만 말할게.
var는 잊어!
let이랑 const만 써야돼.

보안이슈때문에 그래. 소규모 지들끼리 깔깔거리는 프로젝트면 사실 상관없긴 한데, 나중에 아는체할때 개쪽당할 수 있어.
var는 절때 쓰지마!!!!!!!!!!!!!!!!!!!!!!!!!!

변수 선언(변하는 값)은 let, 상수 선언(불변하는 값)은 const를 써.

2. node.js
너희, Javascript가 웹의 표준언어인건 알고 있니?
개발하는데 2주도 안걸렸고 문법도 좆나 병신같지만 어쩌다보니 그렇게 됐어.
아무튼 Javascript는 웹에서 동작하는 언어라 그런지, 브라우저(웹이라 생각하셈ㅎ) 아닌 환경에선 씨발러미 돌아가지를 않아.
그래서 사람들이 node.js라는, 브라우저 밖에서도 돌아가는 런타임 환경을 만들었어!
역시 거인의 어깨 위에서 코딩하라는 성현들의 말씀처럼, 우리는 미련하게 브라우저상에서 f12(개발자환경) 켜서 개지랄하지 말고 node.js를 깔아서 편하게 터미널 환경에서 코딩하자!

아...뇌용량 32킬로바이트 이만빈의 머리에선 이정도밖에 떠오르지 않아... 
팁이 두개밖에 안되긴 하지만 이정도만 알아도 Javascript개발에 좋은 방향성을 제시해준거야!
다들 이만빈 사마를 기억해달라고!!
*/
